## Data Cleaning (Housing Prices)

### Avg Housing Prices 2020

In [1]:
# Import modules
import pandas as pd
import numpy as np

In [6]:
# Load dataset
house_2020 = pd.read_csv('housing_data/nyc_housing_prices_jul_2020.csv')
house_2020.head()

    borough            neigborhood  studio 1_bedroom 2_bedroom 3_bedroom
0  manhatan                Chelsea  $2,794    $4,062    $6,997   $11,031
1  manhatan           East Village  $2,608    $3,280    $4,044    $5,289
2  manhatan  Flatiron/Union Square  $3,632    $4,645    $8,267   $15,969
3  manhatan          Gramercy Park  $2,569    $3,656    $5,413    $7,226
4  manhatan      Greenwich Village  $2,828    $4,116    $8,000   $12,418

In [185]:
# Format and clean borough column
borough = house_2020['borough'].tolist()
borough = [word.replace('manhatan', 'Manhattan') for word in borough]
borough = [word.replace('brooklyn', 'Brooklyn') for word in borough]

In [186]:
# Format and clean studio column
studio = house_2020['studio'].tolist()
studio = [word.replace('-', '0') for word in studio]
studio = [word.replace('$', '') for word in studio]
studio = [word.replace(',', '') for word in studio]
studio = [int(s) for s in studio]

In [187]:
# Format and clean 1_bedroom column
bed1 = house_2020['1_bedroom'].tolist()
bed1 = [word.replace('$', '') for word in bed1]
bed1 = [word.replace(',', '') for word in bed1]
bed1 = [int(s) for s in bed1]

In [188]:
# Format and clean 2_bedroom column
bed2 = house_2020['2_bedroom'].tolist()
bed2 = [word.replace('$', '') for word in bed2]
bed2 = [word.replace(',', '') for word in bed2]
bed2 = [int(s) for s in bed2]

In [189]:
# Format and clean 3_bedroom column
bed3 = house_2020['3_bedroom'].tolist()
bed3 = [word.replace('-', '0') for word in bed3]
bed3 = [word.replace('$', '') for word in bed3]
bed3 = [word.replace(',', '') for word in bed3]
bed3 = [int(s) for s in bed3]

In [190]:
# Create new DataFrame from transformed data
house_2020_clean = pd.DataFrame({'Borough': borough, 
                            'Neighbourhood': df['neigborhood'],
                            'Studio': studio,
                            '1_Bed': bed1,
                            '2_Bed': bed2,
                            '3_Bed': bed3})

house_2020_clean.head()

     Borough          Neighbourhood  Studio  1_Bed  2_Bed  3_Bed
0  Manhattan                Chelsea    2794   4062   6997  11031
1  Manhattan           East Village    2608   3280   4044   5289
2  Manhattan  Flatiron/Union Square    3632   4645   8267  15969
3  Manhattan          Gramercy Park    2569   3656   5413   7226
4  Manhattan      Greenwich Village    2828   4116   8000  12418

In [191]:
# Replace values that are '-' with NaN (null) as to not skew numeric data
house_2020_clean = house_2020_clean.replace(0, np.nan)

In [192]:
house_2020_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55 entries, 0 to 54
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Borough        55 non-null     object
 1   Neighbourhood  55 non-null     object
 2   Studio         54 non-null     float64
 3   1_Bed          55 non-null     int64
 4   2_Bed          55 non-null     int64
 5   3_Bed          54 non-null     float64
dtypes: float64(2), int64(2), object(2)
memory usage: 2.7+ KB

In [193]:
# Check for nulls
house_2020_clean.isnull().sum()

Borough          0
Neighbourhood    0
Studio           1
1_Bed            0
2_Bed            0
3_Bed            1
dtype: int64

There are 2 nulls as housing prices were not listed for that neighbourhood. Leave as is, as it does not pose a major impact on the overall dataset.

In [194]:
# Check for duplicates
house_2020_clean[house_2020_clean.duplicated()]

Empty DataFrame
Columns: [Borough, Neighbourhood, Studio, 1_Bed, 2_Bed, 3_Bed]
Index: []

No duplicates.

In [195]:
# View variance in numeric features
house_2020_clean.describe()

            Studio        1_Bed         2_Bed         3_Bed
count    54.000000    55.000000     55.000000     54.000000
mean   2522.518519  3226.072727   4960.600000   7777.259259
std     630.860232   904.262803   2167.655156   4822.671104
min    1400.000000  1866.000000   2273.000000   2500.000000
25%    2128.750000  2535.500000   3345.000000   4115.750000
50%    2404.500000  3257.000000   4411.000000   6159.500000
75%    2711.500000  3668.000000   6075.500000  10651.750000
max    5121.000000  6117.000000  12173.000000  26970.000000

In [196]:
# Export to csv
house_2020_clean.to_csv('avg_house_2020.csv')

### Median Housing Prices 2021

In [7]:
# Load dataset
house_2021 = pd.read_csv('housing_data/nyc_housing_prices_feb_2021.csv')
house_2021.head()

,neighborhood,studio,Unnamed: 2,neighborhood.1,1_bedroom,Unnamed: 5,neighborhood.2,2_bedroom,Unnamed: 8,Unnamed: 9,Unnamed: 10
0,Upper West Side,"$1,975",NaN,Upper West Side,"$2,750",NaN,Upper West Side,"$4,350",NaN,NaN,NaN
1,Bedford-Stuyvesant,"$1,650",NaN,Bedford-Stuyvesant,"$1,975",NaN,Bedford-Stuyvesant,"$2,200",NaN,NaN,NaN
2,Bushwick,"$1,731",NaN,Bushwick,"$2,150",NaN,Bushwick,"$2,100",NaN,NaN,NaN
3,Upper East Side,"$1,898",NaN,Upper East Side,"$2,395",NaN,Upper East Side,"$3,295",NaN,NaN,NaN
4,Williamsburg,"$2,491",NaN,Williamsburg,"$2,500",NaN,Williamsburg,"$2,584",NaN,NaN,NaN

In [198]:
# Drop irrelevant or duplicate columns, and format column order
house_2021 = house_2021.drop(columns=['neighborhood', 'neighborhood.1', 'Unnamed: 2','Unnamed: 5', 'Unnamed: 8', 'Unnamed: 9', 'Unnamed: 10'])
house_2021 = house_2021[['neighborhood.2', 'studio', '1_bedroom', '2_bedroom']]

In [199]:
# Fill null values to create equal column lengths
house_2021 = house_2021.fillna('-')

In [200]:
# Format and clean studio column
studio = house_2021['studio'].tolist()
studio = [word.replace('-', '0') for word in studio]
studio = [word.replace('$', '') for word in studio]
studio = [word.replace(',', '') for word in studio]
studio = [int(s) for s in studio]

In [201]:
# Format and clean 1_bed column
bed1 = house_2021['1_bedroom'].tolist()
bed1 = [word.replace('-', '0') for word in bed1]
bed1 = [word.replace('$', '') for word in bed1]
bed1 = [word.replace(',', '') for word in bed1]
bed1 = [int(s) for s in bed1]

In [202]:
# Format and clean 2_bed column
bed2 = house_2021['2_bedroom'].tolist()
bed2 = [word.replace('-', '0') for word in bed2]
bed2 = [word.replace('$', '') for word in bed2]
bed2 = [word.replace(',', '') for word in bed2]
bed2 = [int(s) for s in bed2]

In [203]:
# Create new DataFrame from transformed data
house_2021_clean = pd.DataFrame({'Neighbourhood': house_2021['neighborhood.2'],
                                'Studio': studio,
                                '1_Bed': bed1,
                                '2_Bed': bed2,
                                })

house_2021_clean.head()

        Neighbourhood  Studio  1_Bed  2_Bed
0     Upper West Side    1975   2750   4350
1  Bedford-Stuyvesant    1650   1975   2200
2            Bushwick    1731   2150   2100
3     Upper East Side    1898   2395   3295
4        Williamsburg    2491   2500   2584

In [204]:
# Replace values that are '-' with NaN (null) as to not skew numeric data
house_2021_clean = house_2021_clean.replace(0, np.nan)

In [205]:
house_2021_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205 entries, 0 to 204
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Neighbourhood  205 non-null    object
 1   Studio         137 non-null    float64
 2   1_Bed          194 non-null    float64
 3   2_Bed          205 non-null    int64
dtypes: float64(2), int64(1), object(1)
memory usage: 6.5+ KB

In [206]:
# Check for nulls
house_2021_clean.isnull().sum()

Neighbourhood     0
Studio           68
1_Bed            11
2_Bed             0
dtype: int64

There are nulls in the studio and 1_bed columns, however this is because there is no pricing data for those types of housing.

In [207]:
# Check for duplicates
house_2021_clean[house_2021_clean.duplicated()]

Empty DataFrame
Columns: [Neighbourhood, Studio, 1_Bed, 2_Bed]
Index: []

No duplicates.

In [208]:
# Check numeric data for features
house_2021_clean.describe()

            Studio        1_Bed        2_Bed
count   137.000000   194.000000   205.000000
mean   2019.386861  1999.505155  2522.102439
std     726.458070   656.723483  1104.520526
min     947.000000  1100.000000  1377.000000
25%    1575.000000  1600.000000  1950.000000
50%    1850.000000  1750.000000  2109.000000
75%    2300.000000  2287.500000  2645.000000
max    5900.000000  5483.000000  9295.000000

In [209]:
# Export to csv
house_2021_clean.to_csv('med_house_2021.csv')

### Median Housing Prices 2021 Zip Codes

In [8]:
# Load dataset
house_2021_zip = pd.read_csv('housing_data/nyc_housing_prices_feb_2021_zip.csv')
house_2021_zip.head()

  borough                neighborhood                   zip_codes
0   Bronx               Central Bronx         10453, 10457, 10460
1   Bronx      Bronx Park and Fordham         10458, 10467, 10468
2   Bronx  High Bridge and Morrisania         10451, 10452, 10456
3   Bronx  Hunts Point and Mott Haven  10454, 10455, 10459, 10474
4   Bronx   Kingsbridge and Riverdale                10463, 10471

In [211]:
house_2021_zip.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   borough       42 non-null     object
 1   neighborhood  42 non-null     object
 2   zip_codes     42 non-null     object
dtypes: object(3)
memory usage: 1.1+ KB

In [212]:
# Split zip codes into separate columns
zip = house_2021_zip['zip_codes'].str.split(',', expand=True)
zip.head()

       0       1       2       3     4     5     6     7     8
0  10453   10457   10460    None  None  None  None  None  None
1  10458   10467   10468    None  None  None  None  None  None
2  10451   10452   10456    None  None  None  None  None  None
3  10454   10455   10459   10474  None  None  None  None  None
4  10463   10471    None    None  None  None  None  None  None

In [213]:
# Append zip codes to original DataFrame
house_2021_zip = house_2021_zip.join(zip)

In [214]:
# Drop zip_codes column
house_2021_zip.drop(columns=['zip_codes'], inplace=True)

In [215]:
# Replace null values with '-' for interpretability
house_2021_zip = house_2021_zip.fillna('-')

In [216]:
# Rename columns for interpretability
house_2021_zip.columns = ['Borough','Neighborhood','Zip1','Zip2',
                        'Zip3','Zip4','Zip5','Zip6','Zip7','Zip8'
                        ,'Zip9']

In [217]:
house_2021_zip.head()

,Borough,Neighborhood,Zip1,Zip2,Zip3,Zip4,Zip5,Zip6,Zip7,Zip8,Zip9
0,Bronx,Central Bronx,10453,10457,10460,-,-,-,-,-,-
1,Bronx,Bronx Park and Fordham,10458,10467,10468,-,-,-,-,-,-
2,Bronx,High Bridge and Morrisania,10451,10452,10456,-,-,-,-,-,-
3,Bronx,Hunts Point and Mott Haven,10454,10455,10459,10474,-,-,-,-,-
4,Bronx,Kingsbridge and Riverdale,10463,10471,-,-,-,-,-,-,-

In [218]:
# Check for nulls
house_2021_zip.isnull().sum()

Borough         0
Neighborhood    0
Zip1            0
Zip2            0
Zip3            0
Zip4            0
Zip5            0
Zip6            0
Zip7            0
Zip8            0
Zip9            0
dtype: int64

No nulls.

In [219]:
# Check for duplicates
house_2021_zip[house_2021_zip.duplicated()]

Empty DataFrame
Columns: [Borough, Neighborhood, Zip1, Zip2, Zip3, Zip4, Zip5, Zip6, Zip7, Zip8, Zip9]
Index: []

No duplicates.

In [220]:
# Export to csv
house_2021_zip.to_csv('house_2021_zip.csv')